{
    "records": [
        {
            "attributes": {
                "type": "Opportunity",
                "referenceId": "OpportunityRef1"
            },
            "IsPrivate": false,
            "Name": "Program Architect",
            "Description": "Job Details\r\nSr. Program Architect\r\nSalesforce, the Customer Success Platform and world's #1 CRM, empowers companies to connect with their customers in a whole new way. We are the fastest growing of the top 10 enterprise software companies, the World’s Most Innovative Company according to Forbes, and one of Fortune’s 100 Best Companies to Work For six years running. The growth, innovation, and Aloha spirit of Salesforce are driven by our incredible employees who thrive on delivering success for our customers while also finding time to give back through our 1/1/1 model, which leverages 1% of our time, equity, and product to improve communities around the world. Salesforce is a team sport, and we play to win. Join us!\r\n\r\nThe Program Architect plays a critical role within Salesforce Services, serving as a strategic advisor and Salesforce product and platform expert to the company’s largest, most complex enterprise customers.\r\n \r\n\r\nResponsibilities:\r\n\r\nBecome a highly certified and recognized Salesforce expert.\r\nServe as a Trusted Advisor, drive conversations with our customer’s Enterprise Architects and Business Stakeholders armed with best practices for enterprise architecture functions such as Security, Performance, Development Process, and Application Governance.\r\nAdvise and mentor diverse teams, which include customer and partner resources in technical and functional delivery aspects at a program level, using influence and adaptive communication strategies in scenarios where Senior Architect does not have direct authority over all resources.\r\nContribute to a program vision while advising and articulating program/project strategies on enabling technologies including the Salesforce Platform.\r\nProvide guidance on application and integration development best practices, Enterprise Architecture standards, functional and technical solution architecture & design, environment management, testing, and Salesforce Platform education.\r\nDrive the creation of application and technical design documents which leverage Salesforce best practices and effectively integrate Salesforce into the customer’s infrastructure.\r\nTroubleshoot key customer implementation issues and demonstrate ability to drive to successful resolution. Lead the evaluation of business and technical requirements from a senior level.\r\nReview and correcting project/program direction, approach and key artifacts to keep programs on track and solutions extendable and maintainable going forward.\r\nIdentification and pro-active management of risk areas and commitment to seeing an issue through to complete resolution.\r\nManage customer expectations; negotiate solutions to complex problems with both the customer and third-party partners.\r\nBuild relationships with business partners, internal and external, and contributing to broader goals and growth beyond the scope of a single customer engagement.\r\nContribute to the growth of the Services Practice by identifying and leading internal strategic initiatives to grow the consulting practice, leveraging junior teammates to achieve individual as well as team growth; serving as an active contributor to the practice knowledge and resource base; mentor, educate, and enrich technical and non-technical Salesforce customer and partner colleagues.\r\n\r\nExperience/Skills Required:\r\n \r\n\r\n10+ years of enterprise consulting experience, including implementation experience with one or more common enterprise software solutions (e.g. CRM, ERP), filling positions of increasing responsibility and management of more junior technical resources.\r\n5+ years experience as a Senior Architect and/or CTO in a mid to large sized organization with demonstrated leadership driving an organizational transformation in a matrixed organization.  \r\nExperience with key areas of enterprise architecture, including integration technologies, single sign on, and master data management.\r\nExperience with Waterfall and/or Agile implementation methodologies.\r\nAbility to work independently and be a self-starter.  Proven results leading and overseeing customer and/or partner success stories in the following domains: front- and back-end solution architecture, development and release management strategies, change management, and direct leadership in designing solutions that meet or exceed customer needs.\r\nProven ability to analyze, design, and optimize business processes via technology and integration.\r\nGuiding customers and colleagues in rationalizing and deploying emerging technologies that drive increased business value.\r\nPolished speaker with the ability to evangelize best practices at various levels within a large organization.\r\nA particular desire to continually study new technologies and functionality, as well as be involved in projects that push the capabilities of existing technologies.\r\nStrong communication skills, both written and verbal.  Able to effectively develop materials that are appropriate for the audience.\r\nStrong presentation skills.  Able to effectively present and defend point of view to a variety of audiences.\r\nTravel to client site (average of 75%), but may be higher or lower based on the client engagement.\r\nBachelor's degree required in Computer Science, Software Engineering, Business, or in a related field.\r\nHighly beneficial to have any Salesforce.com product certifications prior to joining. It is expected that you will gain the following certifications as part of the role requirement and onboarding process in the first 3 months:\r\nSFDC Certified Administrator\r\nSales Cloud Consultant\r\nService Cloud Consultant\r\nSFDC Certified Advanced Administrator\r\nSFDC Marketing Cloud Certification\r\nLeadership Qualities:\r\n\r\nPASSION: Passionate about Customer Success\r\nBEGINNERS MIND: Always learning, approaches each interaction with open mind, great listener and hands-on\r\nTHOUGHT LEADER: Strong point of view and executive presence. Confident, but not arrogant, great storyteller\r\nURGENCY: Ability to move fast and drive business value and results\r\nOHANA: Embodies Aloha culture: A team player that everyone enjoys working with and has a generous heart\r\nTRUST: Trust the company’s core values\r\nADAPTABLE: Excels in high levels of uncertainty and change",
            "StageName": "Closed Lost",
            "Amount": 150000,
            "Probability": 0,
            "CloseDate": "2018-10-31",
            "NextStep": "Consulting Interview",
            "Resume__c": "@Resume__cRef1"
        },
        {
            "attributes": {
                "type": "Opportunity",
                "referenceId": "OpportunityRef2"
            },
            "IsPrivate": false,
            "Name": "Salesforce Technical Lead",
            "Description": "Salesforce Technical Lead - 7/30/2018\r\nThe technical lead will be responsible for leading all technical aspects of delivering a Salesforce project, which include custom development as well as data and application integration. He/she is expected to have extensive experience in software development, including, but not limited to, Salesforce technologies such as Visualforce and Apex. The candidate needs to have excellent communication skills, analytical and problem-solving ability, and a deep knowledge of Salesforce technologies and implementation approaches. \r\n\r\nResponsibilities Include: \r\n- Building a project plan for the technical track of project, including build, test, and deployment \r\n- Providing effort estimates for all technical components on a project \r\n- Advising the client and project team on design options and recommendations \r\n- Leading design discussions with the client & developers \r\n- Building complex modules of the custom development solutions \r\n- Providing best practices on general code/UI/integration design and deployment \r\n- Providing best practices for technical aspects of Salesforce configuration, ETL, and data migration/integration \r\n- Conducting code reviews \r\n- Overseeing all technical deliverables and ensuring they follow Liquidhub methodology and best practices. \r\n\r\nQualifications: \r\n- Excellent verbal and written communication skills \r\n- Experience in solution design, particularly with Salesforce. \r\n- 10+ years of experience in software development and/or programming design and systems management \r\n- 5+ years of Salesforce implementation experience \r\n- 3+ years of technical team leadership experience \r\n- Familiar with onshore/offshore delivery model \r\n- Extensive knowledge on force.com platform \r\n- Experience in Salesforce Lightning development is a must \r\n- Knowledge of AppExchange ecosystem \r\n- Broader programming technologies such as HTML, XML, JSON, JQuery, SOAP, AJAX, Javascript , Java, JSP, PHP, .NET, SQL \r\n- Knowledge of different database platforms such as Oracle, DB2, SQL Server \r\n- Knowledge of ETL tools such as Informatica and SSIS \r\n- Experience with other CRM software (Oracle, SalesLogix, Dynamics, etc.) \r\n- Salesforce AppBuilder, Platform Developer 1 and 2 Certification \r\n- Additional certifications such as Sales Cloud, Service Cloud, Community, Technical Architect, etc is a plus",
            "StageName": "Closed Lost",
            "Amount": 170000,
            "Probability": 0,
            "CloseDate": "2018-10-11",
            "Resume__c": "@Resume__cRef1"
        },
        {
            "attributes": {
                "type": "Opportunity",
                "referenceId": "OpportunityRef3"
            },
            "IsPrivate": true,
            "Name": "Salesforce Technical Lead",
            "Description": "Job Description \r\n\r\nCloud First is growing rapidly and is looking to add experienced Salesforce.com Technical Leads to join our team as Associate Managers.  This role will have day-to-day management of our Salesforce.com technical team, onshore and offshore.  You'll oversee programmatic elements, Integration, Data Migration and we'll need you to have a strong understanding of the Salesforce.com platform, and basic to intermediate understanding of integrations, single sign, security, etc. (Mulesoft, Informatica, other ETL tools a huge plus).  You'll coordinate offshore usage with a Solution Architect and Project Manager.  You'll lead development of customized components, so we're looking for candidates who can get their hands dirty and jump in and write code if necessary (Apex, Visualforce).   \r\n\r\nWe can hire for this role anywhere in the US, as long as you are willing and able to travel domestically approximately 80% of the time to meet client needs.  \r\n\r\n\r\nKey Responsibilities may include: \r\n\r\n· You’ll be responsible for environment management. \r\n\r\n· Integrate multiple technologies with Salesforce.com/Force.com. \r\n\r\n· Design and develop advanced customizations utilizing Salesforce.com and Force.com. \r\n\r\n· Manage technical project team members (onshore and offshore). \r\n\r\n· Running workshops, working closely with client, able to talk about tradeoffs e.g. terms of config vs code. \r\n\r\n· Map functional requirements to Salesforce.com features and functionality. \r\n\r\n· Disseminate best practices on solution positioning and delivery. \r\n\r\n· Mentor junior team members in Salesforce.com technology, Force.com, Integration Technologies, and Salesforce.com best practices. \r\n\r\n· Oversee code reviews. \r\n\r\n· Support pre-sales activities inclusive of participating in sales calls and proposal development. \r\n\r\n· Manage offshore resources and provide technical specs to developers.\r\n\r\n \r\n\r\nBasic Qualifications \r\n\r\n· A minimum of 2 years of experience developing Salesforce customizations (Apex/VF), integrations, and developing and executing data migrations. \r\n\r\n· A minimum of 5 years of experience in technology implementation for full lifecycle enterprise software projects. \r\n\r\n \r\n\r\nPreferred Skills \r\n\r\n· Experience managing developers a huge plus. \r\n\r\n· Well-rounded in both functional and technical aspects of a CRM engagement. \r\n\r\n· Excellent communication and presentation skills. \r\n\r\n· Combination of business analysis and technology implementation experience. \r\n\r\n· Ability to adapt to a dynamic work environment and be creative within a team. \r\n\r\n\r\nProfessional Skill Requirements \r\n\r\n· Proven ability to build, manage and foster a team-oriented environment. \r\n\r\n· Proven ability to work creatively and analytically in a problem-solving environment Desire to work in an information systems environment. \r\n\r\n· Excellent communication (written and oral) and interpersonal skills. \r\n\r\n· Excellent leadership and management skills.",
            "StageName": "Closed Lost",
            "Amount": 150000,
            "Probability": 0,
            "CloseDate": "2018-10-31",
            "NextStep": "Pending Analysis",
            "Resume__c": "@Resume__cRef1"
        }
    ]
}